# DividedSurfaceOriginalSurfaceMaterial Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceOriginalSurfaceMaterial Property
ParameterTypeId Class See Also
---
"Surface Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceOriginalSurfaceMaterial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceOriginalSurfaceMaterial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceOriginalSurfaceMaterial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace